import 'package:flutter_pecha/features/plans/models/plan_subtasks_model.dart';


final List<PlanSubtasksModel> subtask = [
  PlanSubtasksModel(
    id: "1",
    contentType: "TEXT",
    content:
        "Avert enemies, harm, and epidemics,\nPacify all conflicts, expand bodily and mental bliss,\nIncrease wealth, dominion, grain, and lifespan,\nAccomplish all desired aims according to one's wishes,\nAnd always protect and guard without negligence.",
    displayOrder: 1,
  ),
  PlanSubtasksModel(
    id: "2",
    contentType: "VIDEO",
    content: "https://www.youtube.com/watch?v=fusKR990UyE",
    displayOrder: 2,
  ),
  PlanSubtasksModel(
    id: "3",
    contentType: "VIDEO",
    content: "https://youtube.com/shorts/k4kzbi48SVc",
    displayOrder: 3,
  ),
  PlanSubtasksModel(
    id: "4",
    contentType: "VIDEO",
    content: "https://www.youtube.com/watch?v=JoyGCOrgPjY",
    displayOrder: 4,
  ),
  PlanSubtasksModel(
    id: "5",
    contentType: "IMAGE",
    content:
        "https://drive.google.com/uc?export=view&id=19dDFtkhowkKg_mtTOGJXp9X_B4B_A6G7",
    displayOrder: 5,
  ),
];

const s3AudioUrl = "https://s3.ap-south-1.amazonaws.com/monlam.ai.stt/Garchen+Rinpoche+STT/guru-yoga-2009/01-Lama.wav";

const List<Map<String, String>> tibetanAudioJson = [
  {
    "text": "ད་འོ་ན། ཆོས་གྲོགས་རྣམ་པ་ལ། དེ་ནས་ང་ཡིས",
    "startTime": "00:13",
    "endTime": "00:17",
  },
  {
    "text":
        "ཨེ་དེ་ནས་བླ་མའི་རྣལ་འབྱོར་གྱི་སྒོ་ནས་རང་གིས་གང་ཤེས་ཤེས་ཞུ་དགོས་ཀྱི་ཡོད་རེད་ཟེར།",
    "startTime": "00:17",
    "endTime": "00:21",
  },
  {
    "text": "དེ་ནས་ཡིན་ན་ད་ལྟ། ཨ། ཆོས་གྲོགས་གསར་རྙིང་རྣམ་པ་སྣ་ཚོགས་ཡོད་རེད།",
    "startTime": "00:22",
    "endTime": "00:27",
  },
  {"text": "ཨེ་ད་རང་གི་", "startTime": "00:28", "endTime": "00:31"},
  {
    "text":
        "ཐོས་བསམ་གྱི་སྦྱངས་པ་གང་ཞེ་དྲག་ཡོད་མ་རེད་ད། རང་གི་ཉམས་མྱོང་ལྟར་དུ་ཞུ་གི་ཡོད་རེད། འགྲིག་ས་ནས་འགྲིག་ས་རེད། མ་འགྲིག་ས་ནས་འདི་ལ་དགོངས་དག་ཞུ་འདི་ན་མཁས་པ་མང་པོ་བཞུགས་ཡོད་རེད་ཁོང་རྣམ་པས་ཡོ་བཅོས་གནང་དགོས་རེད་ཟེར། དེ་ནས་དེ་ཡང་ད་ལྟ་བླ་མ་ཞེས་པའི་མིང་དེ་འདོགས་ཀྱི་ཡོད་རེད། ད་དེ་ལ་ང་ཚོ་གླུ་སྐད་ལྟ་བུ་བྱས་ན།  བླ་ནི་སེམས་ཅན་ཀུན་གྱི་བླ། །མ་ནི་སེམས་ཅན་ཀུན་གྱི་མ། །རྫས།",
    "startTime": "00:32",
    "endTime": "00:57",
  },
  {
    "text":
        "དེ་ནས་བླ་སེམས་ཅན་ཀུན་གྱི་བླ་ཞེ་ན། ག་རེ་རེད། སེམས་ཅན་ཐམས་ཅད་ཀི་ཡིད་ལ་གནས་དགོས་རྒྱུ། བླ་ཞེས་པ་དེ་ཡིད་རེད། ཡིད་ལ་གནས་ཀྱི་ཡོད་རེད།",
    "startTime": "00:58",
    "endTime": "01:07",
  },
  {
    "text":
        "དེའི་ནང་ནས་ཡ།  ཤེས་རབ་དང་ལྡན་པ་སྐལ་པ་དང་ལྡན་པ་ཐམས་ཅད། ལྷག་པར་དུ་དེ་ལ། སེམས་ལ་གནས་རྒྱུ་ཞིག་ཡིན་པ་རེད་རྫས།",
    "startTime": "01:07",
    "endTime": "01:16",
  },
  {
    "text": "དཔེ་ཆ་བཞག་ན་ད་ད་ལྟ་ང་ཚོ།",
    "startTime": "01:16",
    "endTime": "01:19",
  },
  {
    "text":
        "མཁན་པོ་འཇིགས་མེད་ཕུན་ཚོགས་ཀྱིས་གསུངས་ཡོད་རེད། ཨོ་ད་ད་ལྟ་འཛམ་བུ་གླིང་ན། ཨ། དེ་ནས་བྱང་ཆུབ་སེམས་པ། གཅིག་མཚན་གསོལ་དགོས་ན་གང་རེད་དེ། རྒྱལ་བ་ཐམས་ཅད་མཁྱེན་པ་རེད་ཟེར།",
    "startTime": "01:21",
    "endTime": "01:32",
  },
  {
    "text":
        "ཁོང་དེ་ནས་དགེ་འདུན་ཁྲི་ཡི་མངའ་བདག་རེད། དེ་གླེང་དུས་ནས་ཏིག་ཙི་བསོད་ནམས་དང་ཤེས་རབ་ལྡན་པ་ཐམས་ཅད་ཀྱི་རྒྱུད་ལ། འཛམ་བུ་གླིང་གི་ཆོས་ལུགས་གང་ཡིན་པ། མི་རིགས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ཀྱི་དེ་ནས་ད་ལྟ།",
    "startTime": "01:33",
    "endTime": "01:46",
  },
  {
    "text": "རྒྱལ་བ་ཐམས་ཅད་མཁྱེན་པ་རྫས་ན་དེ་ནས། ཨ། ཕལ་ཆེར་",
    "startTime": "01:46",
    "endTime": "01:50",
  },
  {
    "text": "དེ་ནས་སེམས་ལ་གནས་རྒྱུ་ཡིན་པ་རེད། ཨོ་རེད།",
    "startTime": "01:51",
    "endTime": "01:54",
  },
  {
    "text":
        "དེ་ག་རེ་ཡིས་གནས་དགོས་རེད། སེམས་ལ་གནས་པ་དེ་ལ་བླ་བརྫས། རྟག་པར་དྲན་དགོས་པ་དེ་རྒྱུ་ཞིག་རེད་བརྫས།",
    "startTime": "01:55",
    "endTime": "02:01",
  },
  {
    "text":
        "དེ་བྱེད་དགོས་པའི་རྒྱུ་ག་རེ་རེད་ཟེར་ན། ཨོ་ཁོས་སེམས་ཅན་ཐམས་ཅད་ལ་མ་དང་བུའི་འདུ་ཤེས་ཡོད་རེད་ཟེར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཨ་མ་ནང་བཞིན་བརྩེ་བ་ཆེན་པོ་ཡོད་རེད་ཟེར། དེ་བརྩེ་བ་ཆེན་པོ་ཡོད་ན། དེ་ནས་པུ་གུ་ཡང་མ་ལ་གདུང་མ་ཡོད་རེད། དཔེ་དེ་ལྟ་བུ་དེ་ནས་བརྩེ་བའི་ཡོན་ཏན་རེད་ཟེར། བླ་མ་ཞེས་པ་དེ་དེ་ནས། ཨ། དེ་ནས་བླ་མ་གང་ནས་བྱུང་། བླ་མ་དེ་གང་ནས་བྱུང་ཟེར་ན། བླ་མ་དེ་སངས་རྒྱས་ལས་བྱུང་ཡོད་རེད་ཟེར།",
    "startTime": "02:02",
    "endTime": "02:28",
  },
  {
    "text": "སངས་རྒྱས་གང་ལས་བྱུང་རེད། སངས་རྒྱས་སེམས་ཅན་ལས་བྱུང་ཡོད་རེད་ཟེར།",
    "startTime": "02:30",
    "endTime": "02:34",
  },
  {
    "text":
        "སྒང་ནས་སེམས་ཅན་རྣམས་ནི་ག་རེ་རེ་བྱུང་རེད་བརྫས་ན། ད་ངས་རྒྱལ་སྲས་ལག་ལེན་སོ་བདུན་མ་གཏོགས་གང་ཤེས་ཀྱི་མ་རེད། དེ་ཡིན་དུས་རྫོགས་པའི་སངས་གཞན་ཕན་སེམས་ལས་འཁྲུངས་རེད། སེམས་ཅན་གྱི་ནང་ནས་བྱམས་རྗེ་ཆེན་པོ་དེ་རྒྱུད་ལ་འཁྲུངས་རེད། དེ་གིས་རང་གི་བདག་འཛིན་གྱི་དེ་ནས་འཆིང་བ་ལས་གྲོལ་ནས། གཉིས་སུ་འཛིན་པའི་ཤེས་པ་ལས་གྲོལ་ནས་དེ་ནས་",
    "startTime": "02:35",
    "endTime": "02:54",
  },
  {
    "text":
        "གཉིས་སུ་འཛིན་པའི་ཤེས་པ་ཐམས་སངས་ནས། དེ་ནས་གཉིས་སུ་མེད་པའི་ཡེ་ཤེས་དེ་རྒྱས་དེ་ནས། སངས་རྒྱས་བརྫས།",
    "startTime": "02:56",
    "endTime": "03:02",
  },
  {
    "text":
        "དེ་ནས་སངས་རྒྱས་སེམས་ཅན་ལས་བྱུང་ཡོད་རེད་ཟེར། དཔེར་ན་མེ་ཏོག་ལས་ས་བོན་བྱུང་། ས་བོན་ལས་མེ་ཏོག་བྱུང་། འདི་ལྟ་བུ་དེ་ཤེས་ན་",
    "startTime": "03:02",
    "endTime": "03:10",
  },
  {
    "text": "དེ་ནས་སངས་རྒྱས་རྒྱུ་དེ་གང་རེད་རྫས་ན། དཔེར་ན་ད་ལྟ་",
    "startTime": "03:12",
    "endTime": "03:16",
  },
  {
    "text":
        "ད་གོང་ནས་བཤད་པ་ནང་བཞིན། བྱང་ཆུབ་ཀྱི་སེམས་རིན་པོ་ཆེ་དེ་ལ་བརྟེན་ནས།སངས་རྒྱུ་དེ་ག་རེ་སངས། རྒྱས་རྒྱུ་དེ་ག་རེ་རྒྱས།",
    "startTime": "03:16",
    "endTime": "03:24",
  },
  {
    "text":
        "ཨོ། བྱང་ཆུབ་དེ་བདག་ཏུ་འཛིན་པ་དང་། གཉིས་སུ་འཛིན་པའི། བྱང་ཆུབ་སེམས་བསླབ་པ་གཉིས་ལ་བརྟེན་ནས་དེ་ནས་སངས་རྒྱས་ཆགས་ཡོད་པ་རེད་ཟེར།",
    "startTime": "03:25",
    "endTime": "03:33",
  },
  {
    "text":
        "དང་པོ། ཀུན་རྫོབ་བྱང་ཆུབ་སེམས་རིན་པོ་ཆེ་རྒྱུད་ལ་འཁྲུངས་ནས། འོ་རེད། བདག་གཅེས་འཛིན་གྱི་བློ་ཐམས་ཅད་སངས་ནས་གཞན་ཕན་གྱི་བློ་རྒྱ་ཆེན་པོ། ཚད་མེད་པ་བཞི་པོའི་བློ་དེ། རྒྱུད་ལ་སྐྱེས་ནས། དེ་ནས་ཚད་མེད་པ་བཞིའི་བློ་ལ་བརྟེན་ནས། ཨུ། དེ་ནས་གཉིས་སུ་འཛིན་པའི་ཤེས་པ་ཐམས་ཅད་སངས་ནས། དེ་ནས་གཉིས་སུ་མེད་པའི་ཡེ་ཤེས། དེ་ནས་འཁོར་འདས་དབྱེར་མེད་ཀྱི་དཔེར་ན་",
    "startTime": "03:34",
    "endTime": "03:58",
  },
  {
    "text":
        "དཔེར་ན་སངས་ཟེར་ན་གཉིས་སུ་འཛིན་པ་ཐམས་ཅད། རང་གི་སེམས་བདེ་གཤེགས་སྙིང་པོ་ལས་འཛིན་པ་ཐམས་ཅད་སངས་སོང་བ། རྒྱས་ཟེར་ན་སེམས་བདེར་གཤེགས་སྙིང་པོའི་རང་བཞིན་དེ་དེ་ནས་",
    "startTime": "04:00",
    "endTime": "04:09",
  },
  {
    "text":
        "ནམ་མཁས་གར་ཁྱབ་ལ་ཁྱབ་བསྡད་པའི་དཔེ་ཡིན་པ་རེད། ཆོས་སྐུ་མཁའ་ལྟ་བུ་གསུངས།",
    "startTime": "04:09",
    "endTime": "04:14",
  },
];
