Repository: OpenPecha/WeBuddhist-app
Catalog: lib/core/l10n/app_*.arb
Languages: bo, zh

# themeLight
source: Light Mode
bo: འཆར་ངོས་དཀར་པོ།
zh: 浅色模式

# themeDark
source: Dark Mode
bo: འཆར་ངོས་ནག་པོ།
zh: 深色模式

# switchToLight
source: Switch to Light Mode
bo: དཀར་པོའི་ཚད་གཞི་ལ་སྒྲིག་པ།
zh: 切换到浅色模式

# switchToDark
source: Switch to Dark Mode
bo: ནག་པོའི་ཚད་གཞི་ལ་སྒྲིག་པ།
zh: 切换到深色模式

source: Sign in
zh: 登錄

source: Logout
bo: ཕྱིར་ཐོན།
zh: 登出

# onboarding_welcome
source: Welcome to WeBuddhist
zh: 歡迎來到 WeBuddhist

# onboarding_description
source: Where we learn, live, and share Buddhist wisdom every day
zh: 在這裡每天學習、生活與分享佛教智慧

# onboarding_find_peace
source: Find your Peace
zh: 尋找你本有的平靜

# onboarding_continue
source: Continue
zh: 下一步

# onboarding_all_set
source: You are All Setup
zh: 你已設定完成

# home_today
source: Today
bo: དེ་རིང་།
zh: 今天

# home_good_morning
source: Good Morning
bo: སྔ་དྲོ་བདེ་ལེགས།
zh: 早上好

# home_good_afternoon
source: Good Afternoon
bo: ཉིན་གུང་བདེ་ལེགས།
zh: 下午好

# home_good_evening
source: Good Evening
bo: དགོང་དྲོ་བདེ་ལེགས།
zh: 晚上好

# home_meditationTitle
source: Meditation
bo: དངོས་གཞི་སྒོམ།
zh: 禪修時刻

# home_goDeeper
source: Go Deeper
bo: ཞིབ་གཟིགས།
zh: 深入了解

# home_intention
source: My Intention for Today
bo: ངའི་དེ་རིང་གི་དམིགས་པ།
zh: 今日心願

# home_recitation
source: Recitation
bo: བཟླས་པ།
zh: 持誦

# home_bringing
source: Bringing it to life
bo: བློ་སྦྱོང་གོམས་འདྲིས།
zh: 融入生活

# no_feature_content
source: No featured content available
bo: རྒྱུ་ཆ་མིན་འདུག
zh: 尚無內容

# nav_home
source: Home
bo: འདུན་ངོས།
zh: 首頁

# nav_texts
source: Texts
bo: ཡིག་མཛོད།
zh: 文本

# nav_recitations
source: Recitations
bo: ཞལ་འདོན།
zh: 唱誦

# nav_practice
source: Practice
bo: ཉམས་ལེན།
zh: 修持計劃

# nav_settings
source: Me
bo: སྒྲིག་འགོད།
zh: 設定

# nav_ai_mode
source: AI
bo: རིག་ནུས་
zh: 人工智能

# text_browseTheLibrary
source: Browse The Library
bo: དཀར་ཆག
zh: 瀏覽文庫

# text_search
source: Search
bo: འཚོལ་ས།
zh: 搜尋

# text_detail_rootText
source: Root
bo: རྩ་བ།
zh: 原文本

# text_detail_commentaryText
source: Commentary
bo: འགྲེལ་བ།
zh: 釋論

# text_toc_content
source: Contents
bo: ས་བཅད།
zh: 內容

# text_toc_versions
source: Versions
bo: འགྱུར་མ་དང་དཔེ་རྒྱུན།
zh: 版本

# text_commentary
source: Commentary
bo: འགྲེལ་བ།
zh: 注釋

# text_close_commentary
source: Close commentary
zh: 關閉注釋

# commentary_total
source: Total
zh: 總計

source: Show more
bo: མང་བ་བསྟོན།
zh: 顯示更多

source: Show less
bo: ཉུང་བ་བསྟོན།
zh: 顯示較少

source: Read more
bo: མང་ཙམ་ཀློགས།
zh: 閱讀更多

# no_content
source: No content found
bo: རྙེད་མ་བྱུང།
zh: 尚無相關內容

# no_version
source: No versions found
bo: རྙེད་མ་བྱུང།
zh: 尚無相關版本

# no_commentary
source: No commentary found
bo: རྙེད་མ་བྱུང།
zh: 尚無相關注釋

# no_commentary_message
source: There are no commentaries available for this segment.
zh: 此偈誦尚無相關注釋

source: Loading...
bo: ལེན་བཞིན་པ་་་
zh: 加載中...

source: Choose Image
bo: པར་འདེམས།
zh: 選擇圖像

# choose_bg_image
source: Choose Your Background Image
bo: རྒྱབས་ངོས་ཀྱི་པར་རིས་འདེམས།
zh: 選擇背景

source: Create Image
bo: པར་རིས་བཟོས།
zh: 創建圖像

source: Save
bo: ཉར་ཚགས།
zh: 儲存

source: Done
bo: འགྲིག
zh: 完成

# customise_message
source: Tap the customize icon to adjust text style
bo: ཡིག་གཟུགས་སྒྲིག་བཀོད་བྱེད་པར་སྒྲིག་བཀོད་ཀྱི་མཚོན་རྟགས་ལ་གནོན།
zh: 點擊自訂以調整字型大小

source: Download Image
bo: པར་རིས་ཕབ་ལེན་བྱེད།
zh: 下載圖像

source: No images available
bo: འདྲ་པར་མི་འདུག
zh: 沒有可用的圖片

source: Customise Text
bo: ཡི་གེ་སྒྲིག་བཀོད་བྱེད།
zh: 自訂文字

source: Text Size
bo: ཡིག་གཟུགས་ཆེ་ཆུང་།
zh: 文字大小

source: Text Color
bo: ཡིག་གཟུགས་མཚོན་ཁྲ།
zh: 文字顏色

source: Text Shadow
bo: ཡི་གེའི་གྲིབ་གཟུགས།
zh: 文字陰影

source: Apply
bo: ཉར་ཚགས།
zh: 執行

# practice_nav_title
source: Practice
bo: ཉིན་རེ་ཉམས་ལེན།
zh: 修持計劃

source: My Plans
bo: ངའི་ཉམས་ལེན།
zh: 我的計畫

source: Find Plans
bo: ཉམས་ལེན་འཚོལ།
zh: 尋找計劃

source: Browse Plans
bo: ཉམས་ལེན་འཚོལ།
zh: 尋找計劃

source: Plan Info
bo: ཉམས་ལེན་ངོས་སྤྲོད།
zh: 計畫內容

source: Start Plan
bo: ཉམས་ལེན་འགོ་འཛུགས།
zh: 開始計畫

source: Start Reading
zh: 開始閱讀

source: Continue Plan
bo: ཉམས་ལེན་མུ་མཐུད་
zh: 繼續計劃

source: Language
bo: སྐད་ཡིག
zh: 語言

# dailyPracticeNotificationTitle
source: Daily Practice Reminder
bo: ཉིན་རེའི་ཉམས་ལེན་དྲན་སྐུལ།
zh: 每日修持提醒

# timeForDailyPractice
source: It's time for your daily practice.
bo: ཉིན་རེའི་ཉམས་ལེན་བྱེད་རེན་སོང་།
zh: 到了每天修持的時間了

# recitation_reminder
source: Recitations Reminder.
bo: ཉིན་རེའི་ཞལ་འདོན་དྲན་སྐུལ།
zh: 持誦提醒

# moment_to_pray
source: Take a moment to pray.
bo: ཉིན་རེའི་ཞལ་འདོན་བྱེད་རེན་སོང་།
zh: 這一刻讓我們一起祈願

# plan_unenroll
source: Unenroll
bo: ཉམས་ལེན་ནས་ཕྱིར་ཐོན།
zh: 退出計劃

# unenroll_confirmation
source: Are you sure you want to unenroll from
bo: ནས་ཕྱིར་འཐེན་བྱེད་རྒྱུ་གཏན་ཁེལ་ཡིན་ནམ།
zh: 確定要退出嗎

# unenroll_message
source: Your progress will be permanently lost and cannot be recovered.
bo: ཉམས་ལེན་ནས་ཕྱིར་ཐོན་ཚེ་དེ་དང་འབྲེལ་ཡོད་གནས་ཚུལ་མེད་པར་འགྱུར་གྱི་རེད།
zh: 您的進度將永久丟失，且無法恢復

# practice_plan
source: Practice plans help you stay consistent with your practice. We have a variety of plans to choose from and for different durations.
bo: ཉམས་ལེན་འཆར་གཞི་ཡིས་ཁྱེད་རང་ཉམས་ལེན་ལ་རྒྱུན་མཐུད་ནས་གནས་པར་རོགས་རམ་བྱེད་ཀྱི་ཡོད། ང་ཚོར་འདེམས་རྒྱུའི་འཆར་གཞི་སྣ་ཚོགས་ཡོད་པ་དང་དུས་ཡུན་མི་འདྲ་བ་ཡོད།
zh: 修持計劃幫助您在修持中保持穩定。我們有許多計劃可供選擇，也有時間長短不同的計劃。

source: Search plans...
bo: ཉམས་ལེན་འཚོལ།
zh: 搜尋計畫...

source: Search for plans
bo: ཉམས་ལེན་འཚོལ་ཞིབ་བྱེད།
zh: 搜尋計劃

source: No plans found
bo: རྙེད་མ་བྱུང།
zh: 無相關計劃

# no_days_available
source: No days found
bo: རྙེད་མ་བྱུང།
zh: 無此天數

# notification_turn_on
source: Please turn on Notifications
zh: 請開啟通知

# notification_enable_message
source: Enable notifications to receive daily practice and recitation reminders.
bo: ཉིན་རེའི་ཉམས་ལེན་དང་ཞལ་འདོན་གསལ་བརྡ་ཡོང་ཆེད་གསལ་བརྡ་སྒོ་འབྱེད་གནང་རོགས།
zh: 開啟通知以收取每日修持、持誦提醒

# enable_notification
source: Enable Notifications
bo: གསལ་བརྡའི་སྒོ་ཕྱེས།
zh: 開啟通知

# notification_daily_practice
source: Daily Practice
bo: ཉམས་ལེན་དྲན་བརྡ།
zh: 每日修持

# notification_select_time
source: Select Time
bo: དུས་ཚོད་འདེམ།
zh: 設定時間

source: Reminder Time
zh: 提醒時間

# notification_daily_recitation
source: Daily Recitation
bo: ཞལ་འདོན་དྲན་བརྡ།
zh: 每日持誦

# text_noContent
source: No texts available in the selected language
bo: སྡེ་ཚན་དེའི་ནང་དཔེ་ཆ་མིན་འདུག
zh: 所選語言下無可用文本

# text_switchToTibetan
source: Switch to Tibetan
bo: བོད་སྐད་ཐོག་བལྟ།
zh: 切換成藏文

# recitations_title
source: Recitations
bo: ཞལ་འདོན།
zh: 唱頌

# recitations_my_recitations
source: My Recitations
bo: ངའི་ཞལ་འདོན།
zh: 我的清單

source: Browse Recitations
bo: ཞལ་འདོན་འཚོལ།
zh: 唱頌

# recitations_search
source: Search recitation...
bo: ཞལ་འདོན་འཚོལ།
zh: 搜索

# recitations_search_for
source: Search for recitations
bo: ཞལ་འདོན་འཚོལ་ཞིབ་བྱེད།
zh: 尋找持誦內容

# recitations_no_found
source: No recitations found
bo: རྙེད་མ་བྱུང།
zh: 尚無相關持誦內容

# recitations_saved
source: Recitation saved
bo: ཞལ་འདོན་ཉར་ཚགས་བྱས་ཚར།
zh: 已保存持誦

# recitations_unsaved
source: Recitation removed
bo: རང་ཉིད་ཀྱི་ཞལ་འདོན་ནས་ཕྱིར་ཐན་བྱས་ཚར།
zh: 已移除持誦

# recitations_no_content
source: No recitations available
bo: རྙེད་མ་བྱུང།
zh: 沒有可用的持誦

# recitations_no_saved
source: No saved recitations
bo: ཞལ་འདོན་ཉར་ཚག་བྱས་མིན་འདུག
zh: 沒有已保存的持誦

# recitations_login_prompt
source: Sign in to view your saved recitations
bo: རང་ཉིད་ཀྱི་ཞལ་འདོན་བལྟ་ཆེད་ནང་འཛུལ་གྱིས།
zh: 請登錄以查看您保存的持誦

# recitations_save
source: Save Recitation
bo: རང་ཉིད་ཀྱི་ཞལ་འདོན་ནང་ཉར་ཚགས་བྱེད།
zh: 保存持誦

# recitations_unsave
source: Unsave recitation
bo: རང་ཉིད་ཀྱི་ཞལ་འདོན་ནས་ཕྱིར་ཐན་བྱེད།
zh: 從已保存中移除

# recitations_translation
source: Translation
zh: 翻譯

# no_available
source: Not available
bo: རྙེད་མ་བྱུང།
zh: 無法

# recitations_no_data_message
source: No Recitation Found.
bo: ཞལ་འདོན་རྙེད་མ་བྱུང་།
zh: 此持誦的內容目前不可用。 請稍後再查看。

# recitations_show_translation
source: Show translation
bo: ཡིག་སྒྱུར་མཐོང་།
zh: 顯示翻譯

# recitations_hide_translation
source: Hide translation
bo: ཡིག་སྒྱུར་སྦས།
zh: 隱藏翻譯

# recitations_show_transliteration
source: Show transliteration
bo: སྒྲ་བསྒྱུར་མཐོང་།
zh: 顯示音譯

# recitations_hide_transliteration
source: Hide transliteration
bo: སྒྲ་བསྒྱུར་སྦས།
zh: 隱藏音譯

# recitations_show_recitation
source: Show recitation
bo: བཟླས་པ་མཐོང་།
zh: 顯示持誦

# recitations_hide_recitation
source: Hide recitation
bo: བཟླས་པ་སྦས།
zh: 隱藏持誦

# recitations_show_adaptation
source: Show adaptation
bo: བསྒྱུར་བཅོས་མཐོང་།
zh: 顯示改編

# recitations_hide_adaptation
source: Hide adaptation
bo: བསྒྱུར་བཅོས་སྦས།
zh: 隱藏改編

# next_recitation
source: Next
bo: རྗེས་མ།
zh: 下一步

# settings_appearance
source: Appearance
bo: རྣམ་པ།
zh: 外觀

# settings_notifications
source: Notifications
bo: གསལ་བརྡ།
zh: 通知

source: Notification Settings
bo: གསལ་བརྡ་སྒྲིག་འགོད།
zh: 通知設定

# settings_account
source: Account
bo: མིང་ཐོ།
zh: 帳號

source: Select Language
bo: སྐད་ཡིག་འདེམས།
zh: 語言設定

# logout_confirmation
source: Are you sure you want to log out?
bo: ཁྱེད་རང་ཕྱིར་འཐོན་བྱ་རྒྱུ་བཏན་འཁེལ་ཡིན་ནམ།
zh: 您確定要登出嗎？

source: Cancel
bo: རྩིས་མེད།
zh: 取消

source: Copy
bo: ངོ་བཤུ།
zh: 複製

source: Copied
bo: ངོ་བཤུ་བྱས་ཟིན།
zh: 已複製

source: Share
bo: བརྒྱུད་སྐུར་གྱིས།
zh: 分享

source: Image
bo: འདྲ་པར།
zh: 圖片

source: Feedback
zh: 回饋

# feedback_wishlist
source: Feedback and Wishlist
zh: 回饋及願望清單

source: Author
bo: རྩོམ་སྒྲིག་པ།
zh: 作者

# plans_created
source: Plan created
bo: ཉམས་ལེན་ཁག
zh: 參與設計的計劃

# ai_chat_history
source: Chat History
zh: 對話紀錄

# ai_buddhist_assistant
source: Buddhist AI Assistant
zh: 佛法AI助手

# ai_new_chat
source: New Chat
zh: 新對話

# ai_retry
source: Retry
zh: 重試

# ai_dismiss
source: Dismiss
zh: 略過

# ai_sign_in_prompt
source: Please sign in to access the Buddhist AI Assistant and start meaningful conversations
zh: 請登入以使用佛法AI助手，並展開有深度的對話

# ai_explore_wisdom
source: Explore Buddhist Wisdom
zh: 探索佛法的智慧

# ai_suggestion_self
source: What is self ?
zh: 什麼是自我？

# ai_suggestion_enlightenment
source: How one can attain enlightenment ?
zh: 如何證悟？

# ai_ask_question
source: Ask a question ...
zh: 問一個問題...

# ai_loading_conversation
source: Loading conversation...
zh: 加載對話...

# ai_search_chats
source: Search for chats
zh: 搜尋對話紀錄

# ai_chats
source: Chats
zh: 對話紀錄

# ai_chat_deleted
source: Chat Deleted
zh: 對話已刪除

# ai_no_conversations
source: No conversations yet
zh: 尚無任何對話

# ai_start_new_chat
source: Start a new chat to begin
zh: 開始新對話

# ai_delete_chat
source: Delete Chat
zh: 刪除對話

# ai_delete_confirmation
source: Are you sure you want to delete this chat?
zh: 確定要刪除此對話？

# ai_delete_warning
source: This action cannot be undone.
zh: 此操作執行後將無法復原

# ai_confirm
source: Confirm
zh: 確認

# ai_delete
source: Delete
zh: 刪除

# routine_title
source: Your Routine
zh: 日常修持

# routine_empty_title
source: Routine
zh: 日常修持

# routine_edit
source: Edit
zh: 編輯

# routine_empty_description
source: Stay consistent in your prayer life by building your routine. Select times and sessions and we'll remind you to prayer!
zh: 建立您的日常修持，保持祈禱生活的穩定。選擇時間和課程，我們會提醒您祈禱！

# routine_build
source: Build your Routine
zh: 建立日常修持

# routine_session
source: Session
zh: 課程

# routine_time
source: Time
zh: 時間

# routine_notification
source: Notification
zh: 通知

# routine_save
source: Save Routine
zh: 保存日常修持

# routine_morning
source: Morning
zh: 早晨

# routine_afternoon
source: Afternoon
zh: 下午

# routine_evening
source: Evening
zh: 晚上

# routine_add_session
source: Add Session
zh: 添加課程

# routine_select_time
source: Select Time
zh: 選擇時間

# routine_remind_me
source: Remind me
zh: 提醒我

# routine_edit_title
source: Edit Your Routine
zh: 編輯日常修持

# routine_delete_block
source: Delete Time Block
zh: 刪除區塊

# routine_add_plan
source: Add Plan
zh: 添加計劃

# routine_add_recitation
source: Add Recitation
zh: 添加持誦

# appTitle
source: WeBuddhist
bo: པེ་ཆ་འཇུག

# learnLiveShare
source: Learn, Live, and Share
bo: སློབ་སྦྱོང་དང་འཚོ་བ་དང་མཉམ་འབྲེལ།

# home_profile
source: Profile
bo: ངོ་སྤྲོད་སྙིང་བསྡུས།

# text_toc_continueReading
source: Continue Reading
bo: སྔར་གྱི་མཚམས་ནས་ཀློག།

source: Tibetan
bo: བོད་ཡིག

source: Sanskrit
bo: ལེགས་སྦྱར་སྐད།

source: English
bo: ཨིན་ཇི།

source: Chinese
bo: རྒྱ་ཡིག།
